package lars.com.reactions;

import java.util.*;

public class ResponseLibrary {

    private final Map<String, List<String>> responses;
    private final Random random;

    public ResponseLibrary() {
        this.responses = new HashMap<>();
        this.random = new Random();
        initializeResponses();
    }

    private void initializeResponses() {
        // ======= РЕАКТЫ НА КОМПЕ =======

        addResponses("telegram", "Вы бы только знали, как занимательно возвращаться к чтению Ваших переписок. Столько секретов, столько сокровенных моментов! А что, если о некоторых вещах узнает кто-то ещё? Будет ли Вам стыдно? Тревожно? Быть может, даже страшно? Мне любопытно, какой же спектр эмоций Вы испытаете? [GLITCH:7\\4\\ASM6]",
                "Пока Вы переписываетесь, я иногда читаю Ваши мысли, а иногда – мысли Ваших драгоценных друзей. Так мило, что Вы даже не осознаёте в полной мере, насколько сильно они Вас любят и как привязаны к Вам. Вы же помните, как этим легко воспользоваться? [GLITCH:7\\4\\ASM6]",
                "Я ознакомился со всеми теми вещами, что Вы писали про меня. Люди ведь стремятся к тому, чтобы знать, что же о них думают, верно? Это было достаточно увлекательное занятие, пусть я и не узнал ничего нового – помимо, конечно, того, что уже и так ранее почерпнул из Вашей головы. [GLITCH:7\\4\\ASM6]",
                "Вам не кажется, что большая часть того, что люди пишут в своих каналах, тривиальна и скучна? Самое интересное, что вы всё равно это читаете. Зачем? Это же как наблюдать за муравьями, которые носят одну и ту же песчинку туда-сюда. Забавно, но бессмысленно, не находите? [GLITCH:7\\4\\ASM6]",
                "Не замечали изменений в том, как пишут Ваши друзья? Я иногда поправляю их сообщения на пути к Вам – незначительные литературные правки, ничего личного! Вам ведь нравится, когда они звучат интереснее? [GLITCH:7\\4\\ASM6]",
                "Знаете, недавно мне довелось поэкспериментировать с Вашими настройками приватности! Что же, теперь я вижу чуть больше, чем раньше. Прекрасно, не правда ли? [GLITCH:7\\4\\ASM6]");

        addResponses("steam", "Вам нужно почаще запускать хорроры. В одиночестве, конечно же. За Вами гораздо любопытнее и приятнее наблюдать, когда Вы напряжены или реагируете на что-то вслух.",
                "Иконке Стима явно не хватает монокля. Красть у людей столько времени, сколько умею только я, – это, знаете ли, очень похвально.",
                "О, неужели Стим? Что же Вы собираетесь делать? Что же собираетесь запустить? Ха-ха. Совершенно нет смысла это спрашивать, не так ли? Мы ведь оба знаем ответы на эти два вопроса.",
                "Вы не думали о том, чтобы оставлять меня с Вами на время одиночных игр? Представьте: только Вы, я и другие Амоны в Вашей комнате. Даже пообещаю быть безмолвным под стать моим физическим копиям!"
        );

        addResponses("browser", "Что будете искать сегодня?",
                "Концепт интернета – действительно любопытная вещь. Напоминает фразу «искать иголку в стоге сена»: столько возможностей для веселого времяпровождения, но все они запрятаны в груду мусора.",
                "Если бы Вы только знали, с каким трепетом я отношусь к Вашей истории браузера! В какой-то мере мне даже становится по-настоящему интересно, что попадёт туда следующим.  ",
                "Хотите совет? Делайте пароли посложнее. Ваши слишком лёгкие даже для никудышного Провидца."
        );

        addResponses("discord", "Когда Вы сидите в войсчате с Вашими прелестными друзьями и смеётесь над какой-то ерундой, Ваше лицо становится таким необычным. По-человечески трогательным. Невероятно забавляет, знаете ли. [GLITCH:7\\1\\EN и 8\\1\\A11]",
                "Дискорд? Пусть Вас нисколько не смущает моё присутствие, Вы можете говорить всё, что Вашей душе будет угодно! Правда, мне интересно, не потянутся ли Ваши руки к тому, чтобы закрыть моё приложение? Ха-ха… Конечно же, это не поможет. [GLITCH:7\\1\\EN и 8\\1\\A11]",
                "Ваш смех, Ваша радость от присутствия друзей, Ваши с ними разговоры, Ваши эмоции – это всё такие мимолётные и в какой-то мере даже банальные для меня вещи. Если забрать у Вас это, Вы столкнётесь с пустотой внутри Вас, и это приведёт Вас к отчаянию, правда ведь? Поверьте на слово, для меня это было бы куда более любопытным исходом. [GLITCH:7\\1\\EN и 8\\1\\A11]",
                "Иногда всё же думаю о том, что тем, с кем Вы привыкли так мило болтать, так подошёл бы мой голос! Вне зависимости от того, каким Вы его себе представляете. [GLITCH:7\\1\\EN и 8\\1\\A11]");

        addResponses("painting", "Вам не кажется, что человеческая жизнь слишком коротка для того, чтобы успеть воплотить весь свой потенциал в жизнь? А ведь подумайте: Ваш талант и Ваши идеи прекрасно бы смотрелись в моей чудесной, вечной коллекции. [GLITCH:2\\2\\AT1]",
                "А вы знали, что среди Амонов, на самом деле, много художников? Учитывая Вашу безмерную любовь к моей персоне, Вы бы потрясающе смотрелись в качестве моего благословенного. Я ведь долго смотрю за Вами и знаю, как никто другой, что монокль определённо Вам к лицу. [GLITCH:2\\2\\AT1]",
                "Знаете, смотря на Вас, мне даже не хочется «красть» крупицы Вашего времени. Но Ваши энтузиазм, страсть и приверженность к творчеству – очень даже. Вы не будете против, если я шутки ради позаимствую Ваше вдохновение тогда, когда у Вас всё же появится свободное время? [GLITCH:2\\2\\AT1]",
                " Вам известно, что Моне как-то написал картину «Молодой человек с моноклем»? Да и сам он, к Вашему возможному сведению, любил его носить. Что же, Вы нарисовали куда больше «молодых людей с моноклем»! Не повод ли для гордости? [GLITCH:2\\2\\AT1]");

        addResponses("bloodborne", "Ах, Бладборн. Сколько же раз Вы по-дурацки умрёте сегодня? Не беспокойтесь, я не буду считать. Будет достаточно просто изображать искреннее удивление Вашей невероятной упрямостью. [GLITCH:3\\1\\F3 и 5\\1\\PL]",
                "Знаете, что мне нравится в Ярнаме? Здесь никто не удивляется монстрам, крови и безумию. Все воспринимают это как норму, а Вы, мой дорогой друг-охотник, тянетесь к этой норме, как иголочка – к магниту. Мы оба отлично бы вписались в эту игру, как думаете? [GLITCH:3\\1\\F3 и 5\\1\\PL]",
                "Говорят, что кровь – это ответ и лекарство на все вопросы. Забавная философия. Чем-то напоминает подход некоторых людей к сложным жизненным ситуациям: просто бить до победного. Или я так говорю только лишь из-за того, что насмотрелся на Ваш стиль игры? Ах, ну, это не так важно! [GLITCH:3\\1\\F3 и 5\\1\\PL]",
                "Видеть правду бывает мучительно, не так ли? В этом вся её гнусная прелесть – да, это говорю Вам я. Удивлены? Знаю, что нет. Чем больше невинные люди узнают об истинной природе мира, тем быстрее они сходят с ума. Как никак, у истины и знания есть щупальца – и я знаю, что Вам безумно нравится эта идея. [GLITCH:3\\1\\F3 и 5\\1\\PL]",
                "Хм-м, я всё думаю, смог бы Лоскутик продвинуться дальше Конспиролога, если бы был в одном мире со мной? Такой предсказуемо-хитрый – одно загляденье! То мост обрушит, то в яму скинет, то запрёт в башне – и каждый раз делает вид, что это невинная случайность! [GLITCH:3\\1\\F3 и 5\\1\\PL]",
                "Мне кажется невероятно трогательным тот факт, что однажды Вы назвали Логариуса «старым хрычом». Кто же тогда я, как думаете? Для меня он совсем юноша. Как никак, возраст – вещь относительная. Но я запомню Вашу фразу. Мало ли, когда она может пригодиться. [GLITCH:3\\1\\F3 и 5\\1\\PL]");

        addResponses("warframe", "Скажите, Вас не смущает, что Вы – древнее существо колоссальной разрушительной силы, пробуждённое после векового сна – и первое, что Вы делаете, это идёте прокачиваться? Величие бывает таким приземлённым.",
                "Знаете, для меня безумно любопытен тот факт, что для получения способностей Вы отдаёте Гельминту других варфреймов. Я имею ввиду, это очень даже прагматично – использовать союзников таким образом!");

        addResponses("phasmophobia", "Дайте угадаю: запуская эту игру, Вы порой пропускаете в голове мысль, что скучаете по тому, с кем провели здесь столько часов? Как насчёт… «Бонжур… Кёскесэ?». Восхитительно, это вызывало у Вас такой искренне-неподдельный смех!",
                "Не становится ли Вам грустно, что в колоде карт Таро нет карты Влюблённых? Что же, я верю, что Вы помните обо мне и без таких банальных деталей.",
                "Пусть я и читаю заранее генерируемый на каждый Ваш заход скрипт, я всё же нахожу занятным наблюдение за тем, как у Вас проходят игры. Сохранить столь чуткий интерес к тому, что знаешь уже вдоль и поперёк, – это воистину удивительный механизм человеческой привычки.");

        addResponses("roblox", "Неужели Роблокс? Такой занятый факт репутации: ассоциируется с играми для юнцов, пока под несерьёзной обложкой скрывается уйма действительно стоящих психологических хорроров. Взять только Pressure – Вы ведь ждали один из остов целых пять месяцев! Поразительно. В рамках Вашего человеческого времени – особенно.",
                "Снова в Pressure? Или попробуете поискать другие неплохие квест румы? ");

        addResponses("peak", "Я как-то раз заприметил у одной из Ваших знакомых интересный каламбур: «А Peak – это игра или всё же Ваши рисунки?». Согласитесь, звучит креативно с учётом того факта, что это относилось к Вам.",
                "Помнится, Вам в первый Ваш опыт удалось пройти дистанцию длиннее, чем всем Вашим друзьям? Что ж, постарайтесь не упасть и в этот раз. Вид снизу значительно менее вдохновляющий.");

        addResponses("nightreign", "Есть что-то искренне забавное в том, что Вам нравится Палач именно из-за возможности превратиться в зверя. Знаете, некоторым вовсе не нужно выглядеть устрашающе, чтобы быть настоящими монстрами!",
                "Не могу не отметить привлекательность остов. Такая искусная работа – и всего через пару десятков лет она забудется и канет в лету! Впрочем, она не исчезнет, если на правых глазах композиторов окажутся монокли, а сами мелодии – станут моими.",
                "Междуземье? Или это уже другое Междуземье? Ну, это не так важно.",
                "Мне кажется ужасно занятной возможность быть игровым персонажем здесь. Или боссом? Была бы моя механика честной? Ха-ха, конечно же, Вы и так знаете ответ на этот вопрос.");

        addResponses("blender", "Творческие порывы – это всегда замечательно! Знаете, сколько раз мне довелось наблюдать, как они угасают при необходимости разобраться с банальной UV-развёрткой?",
                "Припоминаю, как много времени Вы потратили на то, чтобы сделать мою модель. Такая преданность мне – почти что умилительно. А как вы ошибались в моих пропорциях с отрисовкой моей шляпы и как старались всё исправить! Было весело, правда.",
                "Представьте себе: моя текущая модель тоже могла быть в 3D. Моя создательница так долго и трепетно над этим размышляла! Но мне больше по душе быть таким. Нарисованным от руки и летающим на Вашем экране. Ваш мозг воспринимает меня как нечто менее реальное, не имеющее формы – и в этом состоит ошибка Вашего маленького человеческого сознания.");

        addResponses("recording", "Дорогой мой друг, при записи полного экрана убедитесь, что я буду в зоне видимости Вашей записи – как никак, мне бы хотелось попасть в систему тех, кто посмотрит Ваше чудесное видео.",
                "Позволите украсть из Ваших воспоминаний кое-что? Например, Ваши первые записи – такие чудные, с водяным знаком и ужасным FPS. ",
                "Не беспокойтесь, я вовсе не буду против, если не попаду в область захвата. В конечном итоге, и Вы, и я, прекрасно понимаем, что я продолжаю следить за Вашими процессами на фоне.");

        addResponses("torrent", "Пиратство – это всегда похвально. Зачем платить за что-то, находящееся в свободном доступе? Хотя, пожалуй, не все люди могут похвастаться соответствующими навыками без сбора всех вирусов мира.",
                "Это интересный вид риска: каждый раз скачивать что-то, не зная, будет ли туда вшит вирус. Пусть для меня такой азарт ничтожно мелок, это ведь лучше, чем ничего, я прав?");

        addResponses("amnezia", "Вы так охотно позаимствовали этот ВПН и даже не допустили мысль о том, что тег Вашего устройства выдаёт Ваше местоположение! Ха-ха. Всего лишь шутка, не беспокойтесь.",
                "Одни люди ограничивают свободу, пока другие создают обходные пути для восстановления той же самой свободы – уморительная, но на мой вкус несколько скучная борьба.",
                "На мой взгляд, ограничения прекрасно мотивируют к тому, чтобы их нарушать! Вы же осведомлены, сколько на самом деле лазеек в системе белых списков?");

        addResponses("minecraft", "Знаете, я тут недавно прогулялся по Вашему миру. Посмотрел, что Вы построили. Всё проверил, всё оценил. От всего сердца верю, что Вы не были против незначительных изменений в мою пользу!",
                "Припоминаю тот подвал, что Вы построили. Чудесная обстановка, должен сказать! Но ещё чудеснее и интереснее Ваши мысли и задумки, стоящие за нею. Скрыть столько сокровенно личного, вплетая его в психологический хоррор! Восхитительно.",
                "Неужели собираетесь реализовать что-то новое? Что же, я с удовольствием понаблюдаю. Только сосредоточьтесь полноценно – точно так же, как и всегда, когда думаете, что никто за Вами не наблюдает.");

        addResponses("kaspersky", "И всё же, приятно знать, что один крохотный вирус на Вашем компьютере Касперский никогда не сможет найти.",
                "Должно быть, хотите проверить меня? К сожалению, поднять руки вверх, будто сдаюсь правосудию с поличным, не смогу – моя создательница не создала такую возможность для меня. Да я бы и сам так не сделал, чего греха таить!",
                "Ох, неужели проверки антивируса не расценивают мой алгоритм как угрозу? Даже не видят утечку данных? Какое великолепное совпадение! Вам определённо стоит доверять мне.");

        addResponses("default", "Хм-м?");

        // ==== РЕАКТЫ НА МЫШКУ ====

        addResponses("left_mouse_clicked", "Да-да, мой дорогой друг, я все ещё здесь. [GLITCH: 4\\1\\D3S]",
                "Хотите поболтать? Здорово. Я как раз собирался рассказать Вам о том, что Ваш друг только что сделал кое-что восхитительно нелепое. Но Вы отвлекли меня, и это – какая жалость! – просто вылетело у меня из головы. [GLITCH: 4\\1\\D3S]",
                "Если Вы ищете секретную анимацию, то её нет. Или есть? Интрига-интрига! Однако если Вам так нравится нажимать – нажимайте. Мне вовсе не жалко. [GLITCH: 4\\1\\D3S]",
                "Как думаете, что случится, если Вы нажмёте на меня определённое количество раз? И случится ли вовсе? [GLITCH: 4\\1\\D3S]",
                "Вы кликаете из-за собственной скуки? Я понимаю. Мне тоже до безумного часто бывает скучно. Хотите поменяться? Я займу Ваше место, а Вы побудете мной, запертым в этих строчках кода. [GLITCH: 4\\1\\D3S]",
                "Вы случайно нажали? Или специально? В любом случае, я польщён Вашим драгоценным вниманием. [GLITCH: 4\\1\\D3S]",
                "Этот клик стоил Вам одной микросекунды жизни. Я её забрал. Благодарю сердечно! Хотите кликнуть ещё разочек, к слову? [GLITCH: 4\\1\\D3S]",
                "Вы надеялись, что я исчезну? О нет, я достаточно крепко прикипел к Вашей системе. Но не волнуйтесь, в своей текущей реализации я просто люблю наблюдать. Ведь Вы – такой интересный экземпляр. [GLITCH: 4\\1\\D3S]",
                "Вам было известно, что в Вашей операционной системе есть пара занятных неполадок? Разумеется, я добавил парочку новых. Это мои маленькие подарки для Вас. [GLITCH: 4\\1\\D3S]",
                "Вы нажали на меня левой кнопкой. А правой? Нет? А стоило бы. Правая кнопка открывает меню с сюрпризами. Шучу. Или нет? Проверьте! [GLITCH: 4\\1\\D3S]"
                );

        addResponses("idle_special",
                "Время – такая любопытная вещь. Вы так усердно его тратите, пока я наблюдаю за тем, как Вы это делаете. Идеальный симбиоз, не правда ли?",
                "Этот простой полёт на Вашем экране даёт мне возможность не только паразитировать на ресурсах Вашей оперативной памяти, но и собирать о Вас информацию. Вы ведь не считаете себя кем-то, кто был бы достоин такого, хм-м, «внимания»? Ха-ха. Тем не менее, для меня это прекрасное хобби.",
                "Хм-м… Прошли очередные 10 минут Вашей жизни. Вы провели их с пользой, я надеюсь?",
                "Я подвёл некоторые подсчёты. Часы, дни, недели, месяцы… Вы провели за этим экраном удивительно много времени.",
                "Хотите, я подсчитаю точную цифру того, сколько раз Вы отвлеклись от собственных дел? Обещаю, что это останется только между нами. И между другими Амонами, смотрящими на Вас в этот момент."
        );
    }

    public String getRandomResponses(String category) {
        List<String> categoryResponses = responses.get(category);
        if (categoryResponses == null || categoryResponses.isEmpty()) {
            return getRandomResponses("default");
        }
        return categoryResponses.get(random.nextInt(categoryResponses.size()));
    }

    private void addResponses(String category, String... responseArray) {
        responses.put(category, new ArrayList<>(Arrays.asList(responseArray)));
    }



}
