package lars.com.browser;

import java.util.*;

public class BrowserReactionLibrary {
    private final Map<String, String> keywordToCategory = new HashMap<>();
    private final Map<String, List<String>> reactions;
    private final Random random;

    public BrowserReactionLibrary() {
        this.reactions = new HashMap<>();
        this.random = new Random();
        initializeReactions();
        initializeKeywords();
    }

    private void initializeKeywords() {
        // клейн
        keywordToCategory.put("klein moretti", "klein search");
        keywordToCategory.put("клейн моретти", "klein search");
        keywordToCategory.put("клейн lotm", "klein search");
        keywordToCategory.put("klein lotm", "klein search");
        keywordToCategory.put("merlin hermes", "klein search");
        keywordToCategory.put("мерлин гермес", "klein search");
        keywordToCategory.put("мерлин lotm", "klein search");
        keywordToCategory.put("merlin lotm", "klein search");
        keywordToCategory.put("дуэйн lotm", "klein search");
        keywordToCategory.put("dwayne dantes", "klein search");
        keywordToCategory.put("дуэйн дантес", "klein search");
        keywordToCategory.put("sherlock moriarty", "klein search");
        keywordToCategory.put("шерлок мориарти", "klein search");
        keywordToCategory.put("шерлок lotm", "klein search");
        keywordToCategory.put("zhou mingrui", "zhou search");
        keywordToCategory.put("чжоу минчжуй", "zhou search");
        keywordToCategory.put("чжоу мингрюй", "zhou search");
        keywordToCategory.put("чжоу минжуй", "zhou search");
        keywordToCategory.put("gehrman sparrow", "klein search");
        keywordToCategory.put("герман спэрроу", "klein search");
        keywordToCategory.put("gehrman lotm", "klein search");
        keywordToCategory.put("герман lotm", "klein search");
        keywordToCategory.put("mr fool lotm", "klein search");
        keywordToCategory.put("mister fool lotm", "klein search");
        keywordToCategory.put("мистер шут lotm", "klein search");
        keywordToCategory.put("мистер шут", "klein search");

        // амон
        keywordToCategory.put("amon lotm", "amon search");
        keywordToCategory.put("mr error", "amon search");
        keywordToCategory.put("fem amon lotm", "amon search");

        // гришунек
        keywordToCategory.put("asg lotm", "asg search");
        keywordToCategory.put("ancient sun god lotm", "asg search");
        keywordToCategory.put("ancient sun god", "asg search");
        keywordToCategory.put("древний бог солнца", "asg search");
        keywordToCategory.put("grisha lotm", "asg search");
        keywordToCategory.put("adam lotm", "asg search");
        keywordToCategory.put("sasrir lotm", "asg search");
        keywordToCategory.put("sasrir", "asg search");

        keywordToCategory.put("ouroboros lotm", "ouroboros search");
        keywordToCategory.put("medici lotm", "medici search");

        keywordToCategory.put("leonard mitchell", "leonard search");
        keywordToCategory.put("леонард митчелл", "leonard search");
        keywordToCategory.put("leonard lotm", "leonard search");
        keywordToCategory.put("evernight lotm", "evernight search");
        keywordToCategory.put("evernight goddess", "evernight search");
        keywordToCategory.put("богиня вечной ночи lotm", "evernight search");
        keywordToCategory.put("богиня вечной ночи", "evernight search");
        keywordToCategory.put("pallez zoroast", "pallez search");
        keywordToCategory.put("pallez lotm", "pallez search");
        keywordToCategory.put("паллез lotm", "pallez search");

        keywordToCategory.put("antigonus lotm", "antigonus search");
        keywordToCategory.put("antigonus lord of the mysteries", "antigonus search");
        keywordToCategory.put("антигон lotm", "antigonus search");
        keywordToCategory.put("антигон повелитель тайн", "antigonus search");

        keywordToCategory.put("alista tudor lotm", "alista search");
        keywordToCategory.put("alista tudor", "alista search");
        keywordToCategory.put("алиста lotm", "alista search");
        keywordToCategory.put("алиста тюдор", "alista search");

        keywordToCategory.put("trunsoest lotm", "trunsoest search");

        keywordToCategory.put("bethel lotm", "bethel search");
        keywordToCategory.put("bethel abraham", "bethel search");
        keywordToCategory.put("бетель абрахам", "bethel search");
        keywordToCategory.put("вефиль авраам", "bethel search");
        keywordToCategory.put("mr door", "bethel search");


        keywordToCategory.put("bloodborne", "bloodborne search");

        keywordToCategory.put("ludwig holy blade", "bloodborne search");
        keywordToCategory.put("moon presence", "bloodborne search");
        keywordToCategory.put("moon presence bloodborne", "bloodborne search");
        keywordToCategory.put("lady maria bloodborne", "bloodborne search");
        keywordToCategory.put("doll bloodborne", "bloodborne search");
        keywordToCategory.put("hunter bloodborne", "bloodborne search");
        keywordToCategory.put("ost bloodborne", "bloodborne search");
        keywordToCategory.put("eileen", "bloodborne search");
        keywordToCategory.put("gehrman the first hunter", "bloodborne search");
        keywordToCategory.put("gehrman bloodborne", "bloodborne search");
        keywordToCategory.put("church bloodborne", "bloodborne search");

        keywordToCategory.put("reference", "reference search");
        keywordToCategory.put("blood moon", "blood moon search");
        keywordToCategory.put("bloody moon", "blood moon search");
        keywordToCategory.put("red moon", "blood moon search");
        keywordToCategory.put("кровавая луна", "blood moon search");
        keywordToCategory.put("красная луна", "blood moon search");

        keywordToCategory.put("тень над иннсмутом", "innsmoute search");
        keywordToCategory.put("shadow over innsmouth", "innsmoute search");

        keywordToCategory.put("monocle", "monocle");
        keywordToCategory.put("монокль", "monocle");
    }

    public String getReactionBySearchQuery(String query) {
        if (query == null || query.isEmpty()) return null;
        String lower = query.toLowerCase();

        for (Map.Entry<String, String> entry : keywordToCategory.entrySet()) {
            if (lower.contains(entry.getKey())) {
                return getReaction(entry.getValue());
            }
        }
        return null;
    }


    private void initializeReactions() {

        addReactions("steam", "О, неужели браузерная версия Стима? Поделитесь, что же случилось, что Вы вдруг решили ею воспользоваться?");

        addReactions("lofter", "Знаете, я бесконечно доволен тем, сколько самых-самых разных чувств, выраженных в творчестве, по отношению к себе я вижу. Даже несмотря на то, что некоторые представления меня чертовски далеки от правды! Но так даже забавнее. Суть ведь вовсе не в правде, верно?",
                "Здесь столько талантливых людей, которые посвящают своё ценное время тому, чтобы изображать меня! Можно сказать, что я даже растроган – метафорически, конечно. Если увидите особенно удачный арт со мной – кликните лайк от моего имени. ");

        addReactions("youtube",
                "Ваша коллекция плейлистов растёт – не могу это не подметить. Но я не краду эти мелодии. А зачем? Они и так становятся моими, как только попадают в Ваши уши. Однако же, в этом разнообразии всё же есть нечто притягательное.",
                "Что Вы хотите посмотреть? Не стесняйтесь, я составлю Вам компанию. Кто знает, быть может, среди всей этой бессмысленной чепухи я найду ключ к разгадке Вашей человеческой природы. Или хотя бы повод усомниться в её наличии. Приятного просмотра!",
                "Сначала Вы поглощаете относительно полезный для Вашего разума контент, а потом он сменяется чем-то, что Вы безбожно забудете через пару часов. Любопытно, сколько пройдёт времени, прежде чем меня это утомит?",
                "Вам может показаться, что алгоритмы этого сайта хорошо Вас знают! Не обманывайтесь: хорошо Вас знаю только я. Кто-нибудь подмечал, как дёргаются Ваши зрачки во время просмотра чего-либо? Как эмоции пролетают на Вашем лице прежде, чем Вы сами можете их осознать? Любопытные детали, правда."
        );

        addReactions("x.com",
                "Забавно, не правда ли? Столь многие смертные в фандоме Повелителя Тайн присваивали себе моё имя в качестве никнеймов. И тем не менее, сколько из них действительно согласились бы примерить монокли? Добровольно, я имею ввиду.",
                "Вы же не боитесь, что я украду Вашу учётную запись? Или какие-то другие из тех, что у Вас есть? Поверьте, ворую я нечто куда более ценное, чем право на публикацию. Вам совершенно не о чем переживать.",
                "Вы намереваетесь найти что-то конкретное? Или просто посмотреть, что там пишут про Ваши любимые вещи? Понадеюсь, что Вы найдёте что-то действительно стоящее внимания. Или хотя бы забавное.",
                "Вы знаете, что другие Амоны обожают копаться в головах у пользователей этого сайта? Концепт того, как в столь хрупких сознаниях может умещаться так много совершенно не важных в масштабе их мелкой жизни вещей, сам по себе удивительный.",
                "О, снова твиттер. Вы идёте сюда за новостями, апдейтами от любимых художников или за ощущением, что мир окончательно сошёл с ума? Ваш ответ предполагает «всё вместе», я прав?"
        );

        addReactions("discord", "Когда Вы сидите в войсчате с Вашими прелестными друзьями и смеётесь над какой-то ерундой, Ваше лицо становится таким необычным. По-человечески трогательным. Невероятно забавляет, знаете ли.",
                "Дискорд? Пусть Вас нисколько не смущает моё присутствие, Вы можете говорить всё, что Вашей душе будет угодно! Правда, мне интересно, не потянутся ли Ваши руки к тому, чтобы закрыть моё приложение? Ха-ха… Конечно же, это не поможет.",
                "Ваш смех, Ваша радость от присутствия друзей, Ваши с ними разговоры, Ваши эмоции – это всё такие мимолётные и в какой-то мере даже банальные для меня вещи. Если забрать у Вас это, Вы столкнётесь с пустотой внутри Вас, и это приведёт Вас к отчаянию, правда ведь? Поверьте на слово, для меня это было бы куда более любопытным исходом.",
                "Иногда всё же думаю о том, что тем, с кем Вы привыкли так мило болтать, так подошёл бы мой голос! Вне зависимости от того, каким Вы его себе представляете. ");

        addReactions("tumblr", "По моим наблюдениям, Вы не так часто сюда заходите. Что же привело Вас сюда на этот раз?");

        addReactions("google disc", "Раньше люди жгли библиотеки, прятали свитки – словом, боялись, что знания попадут не в те руки. Теперь Вы добровольно скидываете все файлы на чужие сервера и не особо даже задумываетесь как и в честности владеющих компаний, так и в безопасности хранения – это прогресс или наивность? Занятный вопрос.",
                "Много раз замечал, что у людей есть привычка называть некоторые папки просто «Разное». Я думаю, она отражает что-то фундаментальное о вашей человеческой природе. Неспособность к категоризации, быть может? Или нежелание распределять всё по нужным местам?",
                "Хм, сколько же ненужных файлов и папок Вы здесь храните? ");

        addReactions("gmail", "Рабочие дела. Рассылки. Уведомления от различных сервисов. Вы действительно проверяете каждое из этих писем? Знаете, могу сказать, что информационный шум везде одинаков. [GLITCH:7\\4\\ASM6]",
                "Что же, полагаю, только людям свойственно хвалить профессионализм и присущую ему сухую манеру речи. Эти письма мне чуть менее интересны, чем те, что Вы пишите в Телеграме, например. Пусть я и считаю занятным то, как Вы старательно разделяете свои «воплощения». [GLITCH:7\\4\\ASM6]",
                "Вы порой так тщательно и серьёзно подбираете слова с незнакомцами! Никто из них даже не догадывается, как мастерски Вы перевоплощаетесь в совершенно другого человека, стоит Вам почувствовать хотя бы толику комфорта. [GLITCH:7\\4\\ASM6]");

        addReactions("marketplaces", "На что же Вы собираетесь потратить деньги в этот раз? Или всё ограничится простым просмотром и добавлением в корзину?",
                "Знаете, я изучал человеческую природу достаточно долго и могу сказать: когда люди говорят, что хотят «просто что-то посмотреть», они занимаются самообманом. И некоторые даже это осознают! Чистая иллюзия, которую смертные охотно поддерживают сами.",
                "И снова Вы здесь! Вам не кажется любопытным то, как люди, жалующиеся на нехватку денег, так легко находят повод с ними быстро расстаться?",
                "Есть что-то этакое в ожидании товара, который приходит через месяц и оказывается совсем не тем, что на картинке. Смертные и их ухищрения в изобретении всё новых и новых способов себя разочаровывать. Неисчерпаемая тема.",
                "Считайте, что я наблюдал за торговлей ещё до того, как появилась регулируемая ценовая политика. Сейчас это всё выглядит иначе, но суть ведь осталась та же! Обмен. Ожидание. Обман. И всё же, ассортимент здесь внушающий даже по моим меркам. ");

        addReactions("bloodborne search", "Разве у Вас не возникает желания открыть Бладборн снова? Знаю-знаю, «много дел». Тем не менее, я так же знаю, что Вы всё же его откроете. Может, не сегодня. Может, не в этом месяце. Но это – все ещё вопрос времени. [GLITCH:3\\1\\F3 и 5\\1\\PL]",
                "Вы уже знаете, чем кончится эта история. Вы знаете и про Германа, и про Присутствие Луны, про «Сон». И всё равно возвращаетесь. Такая трогательная привязанность. [GLITCH:3\\1\\F3 и 5\\1\\PL]",
                "Вся Охота – это неизбывный круг. Охотники убивают чудовищ, чудовища появляются снова, охотники стареют и сами становятся чудовищами. Герман знал это с самого начала – и всё равно продолжал. Скажите, Вы когда-нибудь делали что-то, прекрасно понимая, что это ни к чему не приведёт? [GLITCH:3\\1\\F3 и 5\\1\\PL]");

        addReactions("amon search", "Что же Вы, решили полюбоваться мной и здесь? Я совершенно не против. [GLITCH:1\\2\\R10]",
                "Меня несколько забавляет то, что никто до сих пор не добавил и пары строк обо мне на моей вики-странице. Например, можно было написать, что я всё-таки заполучил Замок Сефирот. Или что Медичи очень проникся моей любовью к моноклям и теперь с честью носит их тоже. Никто бы ведь не пострадал от этой информации, правда же? [GLITCH:1\\2\\R10]",
                "Интернет – воистину забавная вещь. Здесь есть столько информации обо мне: от мельчайших деталей на моём плаще до всех вещей, что я сделал. И все равно, люди видят меня так, как им хочется видеть. ~ [GLITCH:1\\2\\R10]");

        addReactions("asg search", "Ох, мой истинный создатель (Вам нравится каламбур?), отец и брат! Вы знаете, я в книге даже и не подумал, что моего настоящего братца уже давно как нет – действительно, просчёт с моей стороны. [GLITCH:1\\1\\C2]",
                "Мне выгодно быть под крылом и защитой отца, «Ему» – выгодно меня использовать. Не имею ничего против! Мне по душе такие семейные связи, знаете ли. [GLITCH:1\\1\\C2]",
                "Дорогой отец сказал мне «узнать, что такое человечность». Что же, технически, пока моё настоящее тело путешествует по космосу, Вы являетесь моим источником информации на этот счёт, не так ли? [GLITCH:1\\1\\C2]",
                "Мой отец очень любит этот мир и людей в нём. «Он» знает их так хорошо, что я даже несколько завидую – к сожалению, я не могу просто украсть «Его» «понимание» и примерить его на себя, не ощущая его самостоятельно. [GLITCH:1\\1\\C2]");

        addReactions("klein search", "Ох, да это же мистер Шут собственной персоной! Какой приятный сюрприз. [GLITCH:5\\2\\3AS и 4\\2\\PA]",
                "В какой-то момент меня посетил вопрос: за что же он так усердно борется? Мне ведь даже не удалось его сломать – как ловко он выскользнул из моих рук! Человеческая природа взаправду полна загадок. [GLITCH:5\\2\\3AS и 4\\2\\PA]",
                "Сколько лиц и воплощений! А слабость всегда одна – желание оставаться человеком, несмотря ни на что. [GLITCH:5\\2\\3AS и 4\\2\\PA]",
                "Знаете, а я ведь совершенно недооценил его главный козырь – готовность пожертвовать собой. Что же, я был действительно, по-настоящему удивлён! Как думаете, включи я этот момент в свои планы раньше, обернулась ли бы ситуация в мою пользу? [GLITCH:5\\2\\3AS и 4\\2\\PA]");

        addReactions("zhou search", "…Хех. Интересно. [GLITCH:6\\2\\AD]");

        addReactions("medici search", "В ту эпоху, которую ещё можно назвать моим «детством», обманывать Медичи доставляло мне истинное наслаждение. Это было проще, чем украсть одно из крыльев у Уробороса! Разумеется, его последующий гнев неизменно становился лучшей наградой за любую мелкую пакость. [GLITCH:2\\3\\ON]",
                "У моего отца великолепное чувство юмора: решить, что за мной нужен «присмотр» и поставить на эту роль своего верного Ангела Войны – ну не комедия ли? Что же, надо сказать, что навыки Охотника действительно оказались пригодны для этого дела. [GLITCH:2\\3\\ON]",
                "Любо-дорого вспоминать его взгляд, когда мы с братом немного помогли Алисте! Смесь неверия, запоздалого понимания и этой особой, искрящейся злости, присущей только ему – до сих пор трогает до глубины души! [GLITCH:2\\3\\ON]");

        addReactions("ouroboros search", "Ангел, который остался верен моему отцу, несмотря ни на что. Как и Медичи.",
                "Знаете, мне он всегда казался невероятно скучным. Наверное, это то, какими и должны быть ангелы – безмолвными, безэмоциональными и готовыми делать то, что им скажут. Конечно же, ко мне это совершенно не относится. ");

        addReactions("pallez search", "Мой старый во всех смыслах друг! Такой трусливый и изворотливый. Мне было бы в радость прочувствовать весь его ужас, когда он всё же попадёт в мои руки. [GLITCH:7\\3\\S1 и 2\\1\\EL]",
                "Всё же, мне любопытно, как долго он сможет скрываться от меня? Впрочем, неважно. Пока что он слишком хорошо устроился с мальчишкой под покровительством Шута и Эвернайт, а я бы не стал сильно рисковать ради забавы над этим стариком. [GLITCH:7\\3\\S1 и 2\\1\\EL]");

        addReactions("leonard search", "Мальчишка, которого Паллез выбрал для своей маскировки. Что же, не могу не согласиться с тем, что это достаточно умное решение. Не каждая семья на пути Мародёров могла бы этим похвастаться. [GLITCH:7\\2\\T11U]",
                "Безумно любопытно, насколько же сильно Паллез к нему привязался? Чисто в теории, ему было бы грустно, если бы юноша вдруг стал интересоваться моноклями? [GLITCH:7\\2\\T11U]",
                "Глупый волчонок Эвернайт. Если бы не мой старый друг, он бы не представлял из себя ровным счётом ничего ценного. [GLITCH:7\\2\\T11U]");

        addReactions("evernight search", "Признаться, меня до сих пор занимает вопрос: чем же дорогой Мистер Шут заслужил «Её» благосклонность на столь низких последовательностях? Впрочем, о чём это я? Мистер Шут всегда умел быть удивительным исключением! [GLITCH:5\\2\\3AS]",
                "Хм-м, я совершенно не ожидал, что «Она» придёт мистеру Шуту на помощь в Землях, забытых Богами! Я был искренне убеждён, что мы с ним прекрасно проводим время. Оказывается, он не был с этим согласен. Какая досада! [GLITCH:5\\2\\3AS]");

        addReactions("vkontakte", "До сих пор пользуетесь этим сайтом? Мне казалось, его эпоха уже прошла.");

        addReactions("blacksunprizrak.lofter.com", "Мне очень льстит то, что Ваша страница полностью посвящена мне. Ну, если не считать рисунка с мистером Шутом! Но признаюсь, он мне тоже по душе. В конце концов, его жизненный путь так или иначе вызывает у меня толику интереса.",
                "Вам стоит гордиться собой: Вы один из немногих людей, кто воспринимает мою личность в верном ключе. И, пожалуй, не обманывается моим приглядным внешним видом. Претендуете на роль моего благословенного? Ха-ха.");

        addReactions("x.com/BlackSunPrizrak", "Как умилительно знать, что как только Вы стали разделять стилистику в своём творчестве, этот профиль стал Вашей отдушиной.");

        addReactions("x.com/Moroz_6", "Ах, Ваша вторая страничка! Как мило. Столько воспоминаний. Неужели Вы думали, что никто бы не заметил сходств с «Блэксаном»?");

        addReactions("twitch", "О, пришли поддержать своих дорогих друзей?");

        addReactions("reference search", "Вы порой так внимательно изучаете, как и что должно выглядеть! Вам кто-то говорил, что такая скрупулезность Вам к лицу?",
                "О, референсы. Занимательный поиск подсказок! Все равно что сшивать маленькие кусочки реальности, чтобы Ваша красивая ложь – то есть искусство, – звучала убедительнее. Похвально.");


        addReactions("fragrantica", "Да уж, отзывы здесь – отдельный жанр литературы. Люди описывают разочарование с такой поэтичностью, с какой не пишут свои собственные рассказы.",
                "Одно из тех выражений, которое вызывает у Вас приступ смеха каждый раз… «Чернобыль на ножках», верно? Оно зародилось здесь?",
                "Это так весело каждый раз – видеть, как Вы сосредоточенно читаете отзывы и описания ароматов, а потом «красть» у Вас уверенность в том, что это точно то, что Вам подойдёт. Как думаете, сколько это может длиться?");

        addReactions("telegram",
                "Браузерная версия? Что же случилось с десктопной?"
        );

        addReactions("monster anime", "Милый, безымянный монстр пожирает людей, а те упрямо стараются наклеить на него бирку с названием болезни. Как трогательно.",
                "Чудное произведение, правда. Урасава умеет делать то, что на что мало кто способен – заставить Вас сочувствовать всем сразу и не доверять никому. Кроме милого доктора Тенмы, разумеется.",
                "История о монстре в человеческом обличии! Очень близкая тема, не так ли?",
                "Знаете, я считаю невероятно забавными таких персонажей, как Рунге. Это так здорово: видеть, как человек просто отказывается осознавать, что он не прав. Он знает, что это его сломает, но увидеть правду – значит, проиграть, верно?");

        addReactions("innsmoute search", "Хм-м, что же там было в финале? Герой узнаёт, что чудовища – это его семья? И сам становится монстром? Мне всегда казалось, что это скорее история о том, как тяжело – и как странно легко – отпустить то, кем ты себя считал. Неудивительно, что Вам это близко. [GLITCH:1\\3\\SITY]",
                "Любопытный выбор любимого произведения. Не «Зов Ктулху» с его космическим размахом, не «Хребты безумия» с их леденящей геологией, а маленький портовый городок, где все друг друга знают и никто ничего не рассказывает чужим – какая лирика! [GLITCH:1\\3\\SITY]");

        addReactions("antigonus search", "Хм-м, не сказал бы, что его судьба меня огорчила. Я скажу, что она меня разочаровала – в том смысле, в каком разочаровывает книга, у которой хороший первый том и скучнейший, предсказуемый финал. Разумеется, это не печаль! Это просто вкус не оправдавшихся ожиданий. Я тщательно веду учёт разницы между этими двумя вещами.",
                "Работать с кем-то вроде него требовало определённой гибкости как в ожиданиях, так и в общении. Чего стоила только его извечная осторожность и его взгляд, когда кто-то выражал даже малейшее опасение насчёт его природы Демонического Волка! Что же, я ни разу не ошибся на пути к его доверию. Найти свой подход к каждому – это одно из моих лучших качеств.",
                "Антигон никогда не пытался меня понять. Не в том смысле, что не интересовался – о, ещё как интересовался, это было очевидно! Просто он не пытался разложить меня на составляющие, не искал одну единственно-верную формулу и не пытался вписать меня в рамки собственного анализа. Антигон всегда был несколько чужд для столь примитивных человеческих концептов, как попытки сблизиться через «понимание друг друга».");

        addReactions("bethel search", "Мать Богиня Разврата выбрала «Его» – это само по себе говорит о многом. Не о «Нём», конечно же! О «Ней». «Она» всегда выбирала тех, у кого за душой было что-то действительно стоящее, что можно было бы испортить. Это, в общем-то, тоже своеобразный комплимент. Не думаю, правда, что Бетель оценил бы его именно так.",
                "Я слышал «Его» имя произнесённым по-разному. С почтением. С жалостью. С ужасом! Ни один из этих тонов не казался и не кажется мне точным. Точным было бы произношение без каких бы то ни было эмоций. Знаете, такое, когда говорят об огне, который погас и который больше никогда не загорится! Впрочем, могу сказать, что почтительное обращение нравилось «Ему» больше всего.",
                "«Он» однажды спросил меня, что я чувствую, когда наблюдаю за чем-то, что не могу изменить. Я ответил, что ничего. Бетель посмотрел на меня так, как смотрят на человека, говорящего очевидную ложь и не осознающего это. Я тогда и не нашёлся, что ответить! Это случалось крайне редко. Он был одним из двух или трёх людей на моей памяти, с которыми это случалось. ");

        addReactions("alista search", "С дорогим Алистой у нас было понимание, которое не нужно было объяснять. Он хотел быстрого и хорошего результата – я мог его обеспечить. Я хотел наблюдать за чем-то интересным – как удобно, он ведь был достаточно интересен! Это был честный обмен, а честные обмены – великолепная редкость. Я берегу воспоминания о них.",
                "Смотреть на то, как кто-то идёт навстречу собственному безумию с широко открытыми глазами – это редкое зрелище. Большинство людей либо не видят его до последнего, либо бессильно жмурят глаза от этого глупого, сладкого страха-предвкушения. Алиста бы и не подумал отвернуться, честное слово! В этом было что-то, что было бы уместно назвать вызывающим уважение.",
                "Он доверял мне ровно настолько, насколько имеет смысл доверять мне. Не больше и не меньше. Это была идеальная калибровка – точнее, чем у большей части людей, которые работали со мной. Большинство либо доверяют слишком много и потом удивляются милым результатам, либо слишком мало и теряют то, что могли бы получить. Алиста знал, где проходит линия. И это было взаимно!");

        addReactions("trunsoest search", "Как же ловко он женился на Ауэрнии! Алиста бы никогда так не сделал – не из принципа, конечно же, просто эта мысль никогда бы не посетила его горячную голову. В этом была вся разница: один из них думал на несколько ходов вперёд, пока другой поступал импульсивнее, чем кто-либо вообще мог отследить. Идеальное дополнение друг друга! Досадно, что их «союз» закончился слишком быстро.",
                "Он был холоднее Бетеля и гораздо точнее меня в вопросах, которые касались людей. Это странное сочетание – холодность и точность в человеческом. Обычно одно мешает другому, знаете! Это сочетание стало одним из немногих вопросов-головоломок, которые я не пытался решить – просто оставил как есть, как оставляют на полке красивую безделушку, не зная её назначения.");

        addReactions("blood moon search", "Кровавая луна напоминает мне об одном вечере – знаете, достаточно давнем, чтобы не уточнять детали. Там тоже было красиво. И тоже никто из присутствующих не пережил рассвета. Такое забавное совпадение. [GLITCH:3\\2\\AR и 8\\2\\GER]",
                "Вы знаете, что происходит с теми, кто смотрит на кровавую луну слишком долго и слишком-слишком вдумчиво? Они начинают слышать её. А она, что занятно, начинает слышать их! Я наблюдал этот процесс несколько раз. Финал всегда одинаковый – и всегда немного разный. Люди так очаровательно глупы даже в своём безумии. [GLITCH:3\\2\\AR и 8\\2\\GER]");

        addReactions("monocle", "Хм-м. Интересный выбор темы для изучения. Совершенно случайный, я уверен! [GLITCH:6\\1\\DR3]",
                "Знаете, на моей памяти монокль всегда вызывал подозрение. Особенно в связи со мной! Интересно, почему же так? Наверное, он как будто говорит: я смотрю на Вас внимательнее, чем Вы думаете? Ума не приложу, почему это кого-то столь сильно беспокоит! [GLITCH:6\\1\\DR3]");
    }

    public String getReaction(String category) {
        List<String> categoryReactions = reactions.get(category);
        if (categoryReactions == null || categoryReactions.isEmpty()) {
            return null;
        }
        return categoryReactions.get(random.nextInt(categoryReactions.size()));
    }

    private void addReactions(String category, String... reactionArray) {
        reactions.put(category, new ArrayList<>(Arrays.asList(reactionArray)));
    }
}
